---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyFloatArray
source: html/a704c791-d70e-3f87-8945-cd38de87e662.htm
---
# AssetPropertyFloatArray Members

Adds a new connected asset attached to this asset property, if it allows it.